## Pandas

#### Instructor: Dan Wang

In [89]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

## 1 Introduction to pandas Data Structures

### 1.1 Seris

In [2]:
li = [4, 7, -5, 3]
li

[4, 7, -5, 3]

In [3]:
np.array(li)

array([ 4,  7, -5,  3])

In [4]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2['a']

-5

In [9]:
obj2['d'] = 5
obj2

d    5
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [11]:
obj2[obj2 > 0]

d    5
b    7
c    3
dtype: int64

In [12]:
obj2 * 2

d    10
b    14
a   -10
c     6
dtype: int64

In [13]:
np.exp(obj2)

d     148.413159
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [14]:
2.731918 in obj2

False

In [15]:
sdata = {'Mumbai': 10000,'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': np.NaN}
obj3 = Series(sdata)
obj3

Mumbai    10000.0
Ohio      35000.0
Texas     71000.0
Oregon    16000.0
Utah          NaN
dtype: float64

In [16]:
states = ['California', 'Ohio', 'Oregon', 'Texas','Utah','Mumbai']
obj4 = Series(sdata, index= states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah              NaN
Mumbai        10000.0
dtype: float64

In [17]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
Utah           True
Mumbai        False
dtype: bool

In [18]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
Utah          False
Mumbai         True
dtype: bool

In [19]:
obj3

Mumbai    10000.0
Ohio      35000.0
Texas     71000.0
Oregon    16000.0
Utah          NaN
dtype: float64

In [20]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Utah              NaN
Mumbai        10000.0
dtype: float64

In [21]:
obj3 + obj4

California         NaN
Mumbai         20000.0
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

### 1.2 DataFrame

In [22]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [23]:
obj = Series(data)

In [24]:
obj

state    [Ohio, Ohio, Ohio, Nevada, Nevada]
year         [2000, 2001, 2002, 2001, 2002]
pop               [1.5, 1.7, 3.6, 2.4, 2.9]
dtype: object

In [25]:
frame = pd.DataFrame(data,index = ['oh','oh','oh','nev','nev'])
frame

      state  year  pop
oh     Ohio  2000  1.5
oh     Ohio  2001  1.7
oh     Ohio  2002  3.6
nev  Nevada  2001  2.4
nev  Nevada  2002  2.9

In [26]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [27]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])

In [28]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [29]:
frame2[['state','year']]

        state  year
one      Ohio  2000
two      Ohio  2001
three    Ohio  2002
four   Nevada  2001
five   Nevada  2002

In [30]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [31]:
frame2.year + 1

one      2001
two      2002
three    2003
four     2002
five     2003
Name: year, dtype: int64

In [32]:
frame2.loc[ 'three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [33]:
frame2.T.one

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [34]:
frame2.iloc[2:4,2:]

       pop debt
three  3.6  NaN
four   2.4  NaN

In [35]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [36]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [37]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [38]:
frame2['debt1'] = 999
frame2

       year   state  pop  debt  debt1
one    2000    Ohio  1.5   NaN    999
two    2001    Ohio  1.7  -1.2    999
three  2002    Ohio  3.6   NaN    999
four   2001  Nevada  2.4  -1.5    999
five   2002  Nevada  2.9  -1.7    999

In [39]:
frame2.state == 'Ohio'

one       True
two       True
three     True
four     False
five     False
Name: state, dtype: bool

In [40]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  debt1  eastern
one    2000    Ohio  1.5   NaN    999     True
two    2001    Ohio  1.7  -1.2    999     True
three  2002    Ohio  3.6   NaN    999     True
four   2001  Nevada  2.4  -1.5    999    False
five   2002  Nevada  2.9  -1.7    999    False

In [41]:
del frame2['eastern']
frame2

       year   state  pop  debt  debt1
one    2000    Ohio  1.5   NaN    999
two    2001    Ohio  1.7  -1.2    999
three  2002    Ohio  3.6   NaN    999
four   2001  Nevada  2.4  -1.5    999
five   2002  Nevada  2.9  -1.7    999

In [42]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [43]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [44]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

## 2 Essential Functionality

### 2.1 Reindexing

In [45]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [46]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [47]:
obj2.fillna(12)

a    -5.3
b     7.2
c     3.6
d     4.5
e    12.0
dtype: float64

In [48]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=12)

a    -5.3
b     7.2
c     3.6
d     4.5
e    12.0
dtype: float64

In [49]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [50]:
obj3.reindex(range(6),  method='bfill') #bfill

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [51]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [52]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'], method ='ffill')
frame2

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

### 2.2 Dropping entries from an axis

In [53]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [54]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [55]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [56]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [57]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [58]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [59]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

### 2.3 Indexing, selection, and filtering

In [60]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [61]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [62]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [63]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [64]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [65]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [66]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [67]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [68]:
data[2:]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [70]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [71]:
data.loc[['Colorado', 'Utah'], 'two']

Colorado    5
Utah        9
Name: two, dtype: int32

In [72]:
data.iloc[1:, 1:]

          two  three  four
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [73]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [90]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

AttributeError: 'DataFrame' object has no attribute 'ix'

In [79]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [91]:
data.ix[data.three > 5, :3]

AttributeError: 'DataFrame' object has no attribute 'ix'

### 2.4 Arithmetic and data alignment

In [92]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [94]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [93]:
s1.values

array([ 7.3, -2.5,  3.4,  1.5])

In [95]:
(s1 + s2).fillna(0)

a    5.2
c    1.1
d    0.0
e    0.0
f    0.0
g    0.0
dtype: float64

In [96]:
s1.add(s2, fill_value=0)

a    5.2
c    1.1
d    3.4
e    0.0
f    4.0
g    3.1
dtype: float64

### 2.5 Function application and mapping

In [97]:
frame = DataFrame(np.random.randn(4, 3), 
                  columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [98]:
frame

               b         d         e
Utah    0.937913 -0.221684  1.439326
Ohio    0.017136  0.377708 -0.669019
Texas  -0.298448  1.687777  0.854040
Oregon  0.277596 -1.558152 -0.707376

In [99]:
np.abs(frame)

               b         d         e
Utah    0.937913  0.221684  1.439326
Ohio    0.017136  0.377708  0.669019
Texas   0.298448  1.687777  0.854040
Oregon  0.277596  1.558152  0.707376

In [100]:
frame

               b         d         e
Utah    0.937913 -0.221684  1.439326
Ohio    0.017136  0.377708 -0.669019
Texas  -0.298448  1.687777  0.854040
Oregon  0.277596 -1.558152 -0.707376

In [101]:
def ran(x):
    print (x['Utah'])
    return np.abs(x).max() - np.abs(x).min()

In [102]:
f = lambda x: np.abs(x).max() - np.abs(x).min()

In [103]:
frame.apply(ran)
#frame.map(f)

0.937913338532485
-0.22168370502893853
1.4393262152808872

b    0.920777
d    1.466093
e    0.770307
dtype: float64

In [104]:
def f(x):
    return Series([x.count(), x.mean(), x.min(), x.max()], index=['count','mean','min', 'max'])
frame.apply(f)

              b         d         e
count  4.000000  4.000000  4.000000
mean   0.233549  0.071412  0.229243
min   -0.298448 -1.558152 -0.707376
max    0.937913  1.687777  1.439326

In [105]:
frame.describe()

              b         d         e
count  4.000000  4.000000  4.000000
mean   0.233549  0.071412  0.229243
std    0.525333  1.347570  1.086094
min   -0.298448 -1.558152 -0.707376
25%   -0.061760 -0.555801 -0.678608
50%    0.147366  0.078012  0.092510
75%    0.442675  0.705225  1.000361
max    0.937913  1.687777  1.439326

### 2.5 Sorting and ranking

In [106]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [107]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [108]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [109]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [110]:
frame.sort_index(1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

## frame.sort_index(axis=3, ascending=False)

In [119]:
frame = DataFrame({'p/e': [4, 7, -3, 2], 'p/s': [0, 1, 2, 3]})
frame

   p/e  p/s
0    4    0
1    7    1
2   -3    2
3    2    3

In [120]:
frame.sort_values(by='p/e')

   p/e  p/s
2   -3    2
3    2    3
0    4    0
1    7    1

In [121]:
frame.sort_values(by=['p/s','p/e'])

   p/e  p/s
0    4    0
1    7    1
2   -3    2
3    2    3

### Correlation and Covariance

In [122]:
ret = DataFrame(np.random.rand(400).reshape((100, 4)),columns=['AAPL', 'GD', 'IBM', 'MSFT'])
ret

        AAPL        GD       IBM      MSFT
0   0.688350  0.103845  0.542319  0.844999
1   0.273783  0.498608  0.298710  0.489094
2   0.809508  0.487823  0.086698  0.573920
3   0.799213  0.012982  0.763769  0.563334
4   0.129527  0.035814  0.715593  0.048830
..       ...       ...       ...       ...
95  0.339503  0.320877  0.193305  0.725586
96  0.248924  0.356421  0.623789  0.699247
97  0.675991  0.833386  0.151404  0.831240
98  0.022498  0.440000  0.120106  0.025289
99  0.120233  0.112928  0.859875  0.887908

[100 rows x 4 columns]

In [123]:
ret.corr()

          AAPL        GD       IBM      MSFT
AAPL  1.000000  0.186218 -0.221759 -0.045913
GD    0.186218  1.000000 -0.170835  0.091065
IBM  -0.221759 -0.170835  1.000000  0.052533
MSFT -0.045913  0.091065  0.052533  1.000000

In [124]:
ret.cov()

          AAPL        GD       IBM      MSFT
AAPL  0.094586  0.015287 -0.019091 -0.004038
GD    0.015287  0.071252 -0.012765  0.006951
IBM  -0.019091 -0.012765  0.078358  0.004205
MSFT -0.004038  0.006951  0.004205  0.081760

## Deal with missing data

In [125]:
from numpy import nan as NA

In [134]:
data = DataFrame([[1., 6.5, 4.], [1., NA, NA],
.....: [NA, NA, NA], [NA, 6, 9.]])
data

     0    1    2
0  1.0  6.5  4.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  9.0

In [147]:
cleaned = data.dropna(thresh = 0)
cleaned

     0    1    2
0  1.0  6.5  4.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  9.0

In [148]:
data.fillna(0)

     0    1    2
0  1.0  6.5  4.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.0  9.0

In [149]:
data

     0    1    2
0  1.0  6.5  4.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  9.0

In [150]:
data.fillna(method='ffill')

     0    1    2
0  1.0  6.5  4.0
1  1.0  6.5  4.0
2  1.0  6.5  4.0
3  1.0  6.0  9.0

In [151]:
data.fillna(data.mean())

     0     1    2
0  1.0  6.50  4.0
1  1.0  6.25  6.5
2  1.0  6.25  6.5
3  1.0  6.00  9.0

In [152]:
s = pd.Series([0, 1, np.nan,np.nan,np.nan, 3])
s

0    0.0
1    1.0
2    NaN
3    NaN
4    NaN
5    3.0
dtype: float64

In [153]:
s.interpolate()

0    0.0
1    1.0
2    1.5
3    2.0
4    2.5
5    3.0
dtype: float64